app/controllers/api/users_controller.rb

INSERT INTO "users" ("fname", "lname", "email", "country", "phone_number", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "users" ("fname", "lname", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save
      login!(@user)
      @cart = Cart.create(customer_id: @user.id)