app/models/user.rb

    def self.new_with_session(params, session)
        super.tap do |user|
        if data = session["devise.facebook_data"] && session["devise.facebook_data"]["extra"]["raw_info"]
            user.email = data["email"] if user.email.blank?
---
SELECT  1 AS one FROM "users" WHERE "users"."email" = $1 AND "users"."id" != $2 LIMIT $3  [["email", "gpark@gmail.com"], ["id", 8], ["LIMIT", 1]]

    def self.from_omniauth(auth)
        where(provider: auth.provider, uid: auth.uid).first_or_create do |user|
---
INSERT INTO "users" ("fname", "lname", "password_digest", "session_token", "created_at", "updated_at", "email", "encrypted_password", "provider", "uid", "name", "image") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
SELECT  "users".* FROM "users" WHERE "users"."provider" = $1 AND "users"."uid" = $2 ORDER BY "users"."id" ASC LIMIT $3  [["provider", "facebook"], ["uid", "10158253431024570"], ["LIMIT", 1]]