app/controllers/users/omniauth_callbacks_controller.rb

    def facebook
        @user = User.from_omniauth(request.env["omniauth.auth"])
        if @user.persisted?
            login!(@user)
            redirect_to "#/home"
            @cart = @user.cart || Cart.create(customer_id: @user.id)
---
INSERT INTO "users" ("fname", "lname", "password_digest", "session_token", "created_at", "updated_at", "email", "encrypted_password", "provider", "uid", "name", "image") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"